In [ ]:
import numpy as np

In [ ]:
import pandas as pd

In [ ]:
from numpy.random import randn

In [ ]:
np.random.seed(101)

In [ ]:
df=pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [ ]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [ ]:
df>0

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [ ]:
booldf=df>0

In [ ]:
booldf

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [ ]:
df[booldf]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df>0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [ ]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [ ]:
df['w']>0

a     True
b     True
c    False
d     True
e     True
Name: w, dtype: bool

In [ ]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [ ]:
df[df['w']>0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df['z']<0]

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001

In [ ]:
 df[df['w']>0][['y','x']]

          y         x
a  0.907969  0.628133
b -0.848077 -0.319318
d -0.933237 -0.758872
e  2.605967  1.978757

In [ ]:
boolser=df['w']>0
result=df[boolser]
result[['y','x']]

          y         x
a  0.907969  0.628133
b -0.848077 -0.319318
d -0.933237 -0.758872
e  2.605967  1.978757

In [ ]:
df[(df['w']>0) & (df['y']>1) ]

          w         x         y         z
e  0.190794  1.978757  2.605967  0.683509

In [ ]:
True and False

False

In [ ]:
True | False

True

In [ ]:
import cv2

In [ ]:
df.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [ ]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [ ]:
newkind='CA NY WY OR CO'.split()

In [ ]:
newkind

['CA', 'NY', 'WY', 'OR', 'CO']

In [ ]:
df['states']=newkind

In [ ]:
df

          w         x         y         z states
a  2.706850  0.628133  0.907969  0.503826     CA
b  0.651118 -0.319318 -0.848077  0.605965     NY
c -2.018168  0.740122  0.528813 -0.589001     WY
d  0.188695 -0.758872 -0.933237  0.955057     OR
e  0.190794  1.978757  2.605967  0.683509     CO

In [ ]:
df.set_index('states')

               w         x         y         z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [ ]:
 df

          w         x         y         z states
a  2.706850  0.628133  0.907969  0.503826     CA
b  0.651118 -0.319318 -0.848077  0.605965     NY
c -2.018168  0.740122  0.528813 -0.589001     WY
d  0.188695 -0.758872 -0.933237  0.955057     OR
e  0.190794  1.978757  2.605967  0.683509     CO

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# Index Levels

outside=['g1','g1','g1','g2','g2','g2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [ ]:
outside

['g1', 'g1', 'g1', 'g2', 'g2', 'g2']

In [ ]:
inside

[1, 2, 3, 1, 2, 3]

In [ ]:
hier_index

MultiIndex([('g1', 1),
            ('g1', 2),
            ('g1', 3),
            ('g2', 1),
            ('g2', 2),
            ('g2', 3)],
           )

In [ ]:
list(zip(outside,inside))

[('g1', 1), ('g1', 2), ('g1', 3), ('g2', 1), ('g2', 2), ('g2', 3)]

In [ ]:
from numpy.random import randn

In [ ]:
df=pd.DataFrame(randn(6,2),hier_index,['a','b'])

In [ ]:
df

             a         b
g1 1  0.324774 -0.386656
   2  0.623022 -0.688781
   3  0.163331  0.917295
g2 1  0.930483 -0.015037
   2 -0.022729 -0.115570
   3 -0.340406 -2.124344

In [ ]:
df.loc['g1'].loc[1]

a    0.324774
b   -0.386656
Name: 1, dtype: float64

In [ ]:
df.index.names=['groups','num']

In [ ]:
df

                   a         b
groups num
g1     1    0.324774 -0.386656
       2    0.623022 -0.688781
       3    0.163331  0.917295
g2     1    0.930483 -0.015037
       2   -0.022729 -0.115570
       3   -0.340406 -2.124344

In [ ]:
df.loc['g2'].loc[2]['b']

-0.11556984017851027

In [ ]:
df.loc['g1'].loc[2].loc['a']

0.6230216744146919

In [ ]:
df

                   a         b
groups num
g1     1    0.324774 -0.386656
       2    0.623022 -0.688781
       3    0.163331  0.917295
g2     1    0.930483 -0.015037
       2   -0.022729 -0.115570
       3   -0.340406 -2.124344

In [ ]:
df.xs(1,level='num')

               a         b
groups
g1      0.324774 -0.386656
g2      0.930483 -0.015037

In [ ]:
d={'a':[1,2,np.nan],'b':[5,np.nan,np.nan],'c':[1,2,3]}

In [ ]:
df=pd.DataFrame(d)

In [ ]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df.dropna(axis=1)

   c
0  1
1  2
2  3

In [ ]:
df.dropna()

     a    b  c
0  1.0  5.0  1

In [ ]:
df.dropna(thresh=2)

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2

In [ ]:
df.fillna(value='fill value')

            a           b  c
0           1           5  1
1           2  fill value  2
2  fill value  fill value  3

In [ ]:
df['a']

0    1.0
1    2.0
2    NaN
Name: a, dtype: float64

In [ ]:
df['a'].fillna(value=df['a'].mean())

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [ ]:
 df['a'].fillna(value=df['a'].mean()) 
 df['b'].fillna(value=df['b'].mean())

0    5.0
1    5.0
2    5.0
Name: b, dtype: float64

In [ ]:
data={'company':['goog','goog','msft','msft','fb','fb'],
      'person':['sam','charlie','amy','vanessa','carl','sarah'],
      'sale':[200,120,340,124,243,350]}

In [ ]:
df=pd.DataFrame(data)

In [ ]:
df

  company   person  sale
0    goog      sam   200
1    goog  charlie   120
2    msft      amy   340
3    msft  vanessa   124
4      fb     carl   243
5      fb    sarah   350

In [ ]:
tanu=df.groupby('company')

In [ ]:
tanu.mean()

          sale
company
fb       296.5
goog     160.0
msft     232.0

In [ ]:
tanu.sum()

         sale
company
fb        593
goog      320
msft      464

In [ ]:
tanu.sum().loc['fb']

sale    593
Name: fb, dtype: int64

In [ ]:
df.groupby('company').max()

          person  sale
company
fb         sarah   350
goog         sam   200
msft     vanessa   340

In [ ]:
df.groupby('company').describe()

         sale
        count   mean         std    min     25%    50%     75%    max
company
fb        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
goog      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
msft      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [ ]:
df1=pd.DataFrame({'a':['a0','a1','a2','a3'],'b':['b0','b1','b2','b3'],
                  'c':['c0','c1','c2','c3'],'d':['d0','d1','d2','d3']},
                 index=[0,1,2,3])

In [ ]:
df2=pd.DataFrame({'a':['a4','a5','a6','a7'],'b':['b4','b5','b6','b7'],
                  'c':['c4','c5','c6','c7'],'d':['d4','d5','d6','d7']},
                 index=[4,5,6,7])

In [ ]:
df1

    a   b   c   d
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [ ]:
df2

    a   b   c   d
4  a4  b4  c4  d4
5  a5  b5  c5  d5
6  a6  b6  c6  d6
7  a7  b7  c7  d7

In [ ]:
pd.concat([df1,df2])

    a   b   c   d
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5
6  a6  b6  c6  d6
7  a7  b7  c7  d7

In [ ]:
pd.concat([df1,df2],axis=1)

     a    b    c    d    a    b    c    d
0   a0   b0   c0   d0  NaN  NaN  NaN  NaN
1   a1   b1   c1   d1  NaN  NaN  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN  NaN  NaN
3   a3   b3   c3   d3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN  NaN   a5   b5   c5   d5
6  NaN  NaN  NaN  NaN   a6   b6   c6   d6
7  NaN  NaN  NaN  NaN   a7   b7   c7   d7

In [ ]:
df1=pd.DataFrame({'key':[0,1,2,3],
                  'c':['c0','c1','c2','c3'],'d':['d0','d1','d2','d3']},
                 index=[0,1,2,3])

In [ ]:
df2=pd.DataFrame({'key':[0,1,2,3],
                  'c':['c4','c5','c6','c7'],'d':['d4','d5','d6','d7']},
                 index=[0,1,2,3])

In [ ]:
pd.merge(df1,df2,how='inner',on='key')

KeyError: ignored

In [ ]:
df1

   key   c   d
0    0  c0  d0
1    1  c1  d1
2    2  c2  d2
3    3  c3  d3

In [ ]:
df2

   key   c   d
0    0  c4  d4
1    1  c5  d5
2    2  c6  d6
3    3  c7  d7

In [ ]:
pd.merge(df1,df2,how='inner', on='key')

   key c_x d_x c_y d_y
0    0  c0  d0  c4  d4
1    1  c1  d1  c5  d5
2    2  c2  d2  c6  d6
3    3  c3  d3  c7  d7

In [ ]:
#matlab :)

In [ ]:
import matplotlib.pyplot as plt

In [ ]:
%matlablib inline

UsageError: Line magic function `%matlablib` not found.